Repository: orkundayi/cv-maker
Catalog: lib/l10n/app_*.arb
Languages: tr

# appName
source: CV Maker
tr: CV Hazırlayıcı

source: Personal Information
tr: Kişisel Bilgiler

# enterBasicContactInfo
source: Enter your basic contact information
tr: Temel iletişim bilgilerinizi girin

source: Clear Personal Information
tr: Kişisel Bilgileri Temizle

# clearPersonalInfoConfirm
source: Are you sure you want to clear all personal information? This action cannot be undone.
tr: Tüm kişisel bilgileri temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Profile Picture
tr: Profil Fotoğrafı

source: Upload Photo
tr: Fotoğraf Yükle

# optionalPhotoHint
source: Optional: Add a professional photo (JPG, PNG)
tr: İsteğe bağlı: Profesyonel bir fotoğraf ekleyin (JPG, PNG)

source: Basic Information
tr: Temel Bilgiler

source: First Name
tr: Ad

source: Last Name
tr: Soyad

# firstNameHint
source: Enter your first name
tr: Adınızı girin

# lastNameHint
source: Enter your last name
tr: Soyadınızı girin

# firstNameRequired
source: First name is required
tr: Ad gereklidir

# lastNameRequired
source: Last name is required
tr: Soyad gereklidir

source: Contact Information
tr: İletişim Bilgileri

source: Email Address
tr: E-posta Adresi

source: Phone Number
tr: Telefon Numarası

# emailRequired
source: Email is required
tr: E-posta gereklidir

# phoneRequired
source: Phone number is required
tr: Telefon numarası gereklidir

# emailInvalid
source: Enter a valid email address
tr: Geçerli bir e-posta adresi girin

source: City
tr: Şehir

source: Country
tr: Ülke

# cityHint
source: New York
tr: İstanbul

# countryHint
source: United States
tr: Türkiye

source: Professional Links
tr: Profesyonel Bağlantılar

# professionalLinksHint
source: Add links to your professional profiles (optional)
tr: Profesyonel profillerinizin bağlantılarını ekleyin (isteğe bağlı)

source: LinkedIn Profile
tr: LinkedIn Profili

source: GitHub Profile
tr: GitHub Profili

source: Personal Website
tr: Kişisel Website

# linkedinHint
source: https://linkedin.com/in/yourprofile
tr: https://linkedin.com/in/profiliniz

# githubHint
source: https://github.com/yourusername
tr: https://github.com/kullaniciadi

# websiteHint
source: https://yourwebsite.com
tr: https://websiteadresiniz.com

source: Professional Summary
tr: Profesyonel Özet

# summaryDescription
source: Write a brief overview of your professional background
tr: Profesyonel geçmişinizin kısa bir özetini yazın

source: Clear Summary
tr: Özeti Temizle

# summaryHint
source: Write a brief overview of your professional background, key skills, and career objectives...
tr: Profesyonel geçmişiniz, temel becerileriniz ve kariyer hedeflerinizin kısa bir özetini yazın...

# clearSummaryConfirm
source: Are you sure you want to clear the summary? This action cannot be undone.
tr: Özeti temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Work Experience
tr: İş Deneyimi

# workExperienceDescription
source: Add your professional work history
tr: Profesyonel iş geçmişinizi ekleyin

source: Clear All Experiences
tr: Tüm Deneyimleri Temizle

source: Add Experience
tr: Deneyim Ekle

source: Edit Experience
tr: Deneyimi Düzenle

source: Job Title
tr: İş Unvanı

source: Company
tr: Şirket

source: Location
tr: Konum

source: Start Date
tr: Başlangıç Tarihi

source: End Date
tr: Bitiş Tarihi

# currentlyWorking
source: Currently working here
tr: Halen burada çalışıyorum

source: Description
tr: Açıklama

# jobTitleHint
source: Software Engineer
tr: Yazılım Geliştirici

# locationHint
source: San Francisco, CA
tr: İstanbul, Türkiye

# descriptionHint
source: Describe your key responsibilities and achievements...
tr: Temel sorumluluklarınızı ve başarılarınızı açıklayın...

# clearExperiencesConfirm
source: Are you sure you want to clear all work experiences? This action cannot be undone.
tr: Tüm iş deneyimlerini temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Education
tr: Eğitim

# educationDescription
source: Add your educational background
tr: Eğitim geçmişinizi ekleyin

source: Clear All Education
tr: Tüm Eğitimleri Temizle

source: Add Education
tr: Eğitim Ekle

source: Edit Education
tr: Eğitimi Düzenle

source: Degree
tr: Derece

source: Institution
tr: Kurum

# degreeHint
source: Bachelor of Computer Science
tr: Bilgisayar Mühendisliği Lisans

# institutionHint
source: Stanford University
tr: İstanbul Teknik Üniversitesi

# clearEducationConfirm
source: Are you sure you want to clear all education entries? This action cannot be undone.
tr: Tüm eğitim kayıtlarını temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Skills
tr: Yetenekler

# skillsDescription
source: Add your technical and soft skills
tr: Teknik ve sosyal becerilerinizi ekleyin

source: Clear All Skills
tr: Tüm Yetenekleri Temizle

source: Add Skill
tr: Yetenek Ekle

source: Edit Skill
tr: Yeteneği Düzenle

source: Skill Name
tr: Yetenek Adı

source: Skill Level
tr: Yetenek Seviyesi

# skillCategory
source: Category
tr: Kategori

# clearSkillsConfirm
source: Are you sure you want to clear all skills? This action cannot be undone.
tr: Tüm yetenekleri temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Beginner
tr: Başlangıç

source: Intermediate
tr: Orta

source: Advanced
tr: İleri

source: Expert
tr: Uzman

source: Technical
tr: Teknik

# soft
source: Soft Skills
tr: Sosyal Beceriler

source: Other
tr: Diğer

source: Languages
tr: Diller

# languagesDescription
source: Add languages you speak
tr: Konuştuğunuz dilleri ekleyin

source: Clear All Languages
tr: Tüm Dilleri Temizle

source: Add Language
tr: Dil Ekle

source: Edit Language
tr: Dili Düzenle

# languageName
source: Language
tr: Dil

# languageLevel
source: Proficiency Level
tr: Yeterlilik Seviyesi

# languageNameHint
source: English
tr: İngilizce

# clearLanguagesConfirm
source: Are you sure you want to clear all languages? This action cannot be undone.
tr: Tüm dilleri temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Native
tr: Ana Dil

source: Fluent
tr: Akıcı

source: Conversational
tr: Konuşma Seviyesi

source: Basic
tr: Temel

source: Certificates
tr: Sertifikalar

# certificatesDescription
source: Add your certifications and achievements
tr: Sertifikalarınızı ve başarılarınızı ekleyin

source: Clear All Certificates
tr: Tüm Sertifikaları Temizle

source: Add Certificate
tr: Sertifika Ekle

source: Edit Certificate
tr: Sertifikayı Düzenle

source: Certificate Name
tr: Sertifika Adı

source: Issuing Organization
tr: Veren Kuruluş

source: Issue Date
tr: Veriliş Tarihi

# clearCertificatesConfirm
source: Are you sure you want to clear all certificates? This action cannot be undone.
tr: Tüm sertifikaları temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Projects
tr: Projeler

# projectsDescription
source: Showcase your personal and professional projects
tr: Kişisel ve profesyonel projelerinizi sergileyin

source: Clear All Projects
tr: Tüm Projeleri Temizle

source: Add Project
tr: Proje Ekle

source: Edit Project
tr: Projeyi Düzenle

source: Project Name
tr: Proje Adı

# projectUrl
source: Live Demo URL
tr: Canlı Demo URL

source: Technologies
tr: Teknolojiler

# projectNameHint
source: E-commerce Website
tr: E-ticaret Website

# urlHint
source: https://myproject.com
tr: https://projem.com

# githubUrlHint
source: https://github.com/username/project
tr: https://github.com/kullaniciadi/proje

source: Live Demo
tr: Canlı Demo

# clearProjectsConfirm
source: Are you sure you want to clear all projects? This action cannot be undone.
tr: Tüm projeleri temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: CV Preview
tr: CV Önizleme

# previewDescription
source: Preview and export your CV
tr: CV'nizi önizleyin ve dışa aktarın

source: Clear All Data
tr: Tüm Verileri Temizle

source: Export PDF
tr: PDF Dışa Aktar

source: Load Demo Data
tr: Demo Veri Yükle

source: Choose Template
tr: Şablon Seç

source: Professional
tr: Profesyonel

# noDataMessage
source: No data available to preview. Please fill in your information in the previous sections.
tr: Önizleme için veri yok. Lütfen önceki bölümlerde bilgilerinizi doldurun.

source: Get Started
tr: Başlayın

# clearAllConfirm
source: Are you sure you want to clear all data? This will remove all your CV information and cannot be undone.
tr: Tüm verileri temizlemek istediğinizden emin misiniz? Bu işlem tüm CV bilgilerinizi silecek ve geri alınamaz.

source: Exporting PDF...
tr: PDF dışa aktarılıyor...

# pdfExported
source: CV exported successfully!
tr: CV başarıyla dışa aktarıldı!

# exportError
source: Failed to export PDF
tr: PDF dışa aktarımı başarısız

# demoDataLoaded
source: Demo data loaded successfully!
tr: Demo veri başarıyla yüklendi!

source: Save
tr: Kaydet

source: Cancel
tr: İptal

source: Clear
tr: Temizle

source: Delete
tr: Sil

source: Edit
tr: Düzenle

source: Add
tr: Ekle

source: Close
tr: Kapat

source: OK
tr: Tamam

source: Previous
tr: Önceki

source: Next
tr: Sonraki

source: Prev
tr: Önceki

source: Help
tr: Yardım

# helpDescription
source: Welcome to CV Maker! Follow these steps to create your professional resume:
tr: CV Hazırlayıcı'ya hoş geldiniz! Profesyonel özgeçmişinizi oluşturmak için şu adımları izleyin:

# helpStep1
source: 1. Enter your personal information
tr: 1. Kişisel bilgilerinizi girin

# helpStep2
source: 2. Write a professional summary
tr: 2. Profesyonel özet yazın

# helpStep3
source: 3. Add your work experiences
tr: 3. İş deneyimlerinizi ekleyin

# helpStep4
source: 4. List your education
tr: 4. Eğitim bilgilerinizi listeleyin

# helpStep5
source: 5. Highlight your skills
tr: 5. Yeteneklerinizi vurgulayın

# helpStep6
source: 6. Add languages you speak
tr: 6. Konuştuğunuz dilleri ekleyin

# helpStep7
source: 7. Include certifications
tr: 7. Sertifikalarınızı dahil edin

# helpStep8
source: 8. Showcase your projects
tr: 8. Projelerinizi sergileyin

# helpStep9
source: 9. Preview and export your CV
tr: 9. CV'nizi önizleyin ve dışa aktarın

# helpTip
source: Tip: All fields are automatically saved as you type!
tr: İpucu: Tüm alanlar yazdığınız anda otomatik olarak kaydedilir!

source: Got it!
tr: Anladım!

# profilePhotoUploaded
source: Profile photo uploaded successfully!
tr: Profil fotoğrafı başarıyla yüklendi!

# personalInfoCleared
source: Personal information cleared successfully
tr: Kişisel bilgiler başarıyla temizlendi

# summaryCleared
source: Summary cleared successfully
tr: Özet başarıyla temizlendi

# experienceCleared
source: Work experiences cleared successfully
tr: İş deneyimleri başarıyla temizlendi

# educationCleared
source: Education entries cleared successfully
tr: Eğitim kayıtları başarıyla temizlendi

# skillsCleared
source: Skills cleared successfully
tr: Yetenekler başarıyla temizlendi

# languagesCleared
source: Languages cleared successfully
tr: Diller başarıyla temizlendi

# certificatesCleared
source: Certificates cleared successfully
tr: Sertifikalar başarıyla temizlendi

# projectsCleared
source: Projects cleared successfully
tr: Projeler başarıyla temizlendi

# allDataCleared
source: All data cleared successfully
tr: Tüm veriler başarıyla temizlendi

# linkOpened
source: Opening in browser...
tr: Tarayıcıda açılıyor...

# linkOpenError
source: Could not open the link
tr: Bağlantı açılamadı

# urlLaunchError
source: Unable to open URL. Please copy and open manually:
tr: URL açılamadı. Lütfen manuel olarak kopyalayıp açın:

source: Language
tr: Dil

source: Degree/Certificate
tr: Derece/Sertifika

# degreeRequired
source: Degree is required
tr: Derece gereklidir

# institutionRequired
source: Institution is required
tr: Kurum gereklidir

source: GPA (Optional)
tr: Not Ortalaması (Opsiyonel)

source: Add New Education
tr: Yeni Eğitim Ekle

source: Skills & Expertise
tr: Yetenekler ve Uzmanlık

source: Languages & Communication
tr: Diller ve İletişim

source: Certifications & Licenses
tr: Sertifikalar ve Lisanslar

# certificationsDescription
source: Professional credentials and achievements
tr: Profesyonel kimlik bilgileri ve başarılar

source: Portfolio & Projects
tr: Portföy ve Projeler

source: CV Sections
tr: CV Bölümleri

source: January
tr: Ocak

source: February
tr: Şubat

source: March
tr: Mart

source: April
tr: Nisan

source: May
tr: Mayıs

source: June
tr: Haziran

source: July
tr: Temmuz

source: August
tr: Ağustos

source: September
tr: Eylül

source: October
tr: Ekim

source: November
tr: Kasım

source: December
tr: Aralık

source: Select Start Date
tr: Başlangıç Tarihi Seç

source: Select End Date
tr: Bitiş Tarihi Seç

source: Year
tr: Yıl

source: Month
tr: Ay

source: Select
tr: Seç

# pleaseSelectStartDate
source: Please select a start date
tr: Lütfen başlangıç tarihi seçin

# pleaseSelectEndDateOrMarkCurrent
source: Please select an end date or mark as current study
tr: Lütfen bitiş tarihi seçin veya devam ediyor olarak işaretleyin

source: Education updated successfully!
tr: Eğitim başarıyla güncellendi!

source: Education added successfully!
tr: Eğitim başarıyla eklendi!

source: Select Issue Date
tr: Veriliş Tarihi Seç

source: Select Expiry Date
tr: Son Kullanma Tarihi Seç

# imageUploadFailed
source: Failed to upload image
tr: Fotoğraf yüklenemedi

# chipInputHint
source: Type and press Enter to add
tr: Eklemek için yazıp Enter’a basın

# certificateHasExpiry
source: This certificate has an expiry date
tr: Bu sertifikanın bir son kullanma tarihi var

source: No expiry
tr: Son kullanım yok

source: Expires
tr: Bitiş

source: Verify Certificate
tr: Sertifikayı Doğrula

# expiryBeforeIssueError
source: Expiry date cannot be before issue date
tr: Son kullanma tarihi, veriliş tarihinden önce olamaz

source: Credential ID (Optional)
tr: Kimlik ID (Opsiyonel)

# credentialIdHint
source: e.g., AWS-12345, PMP-67890
tr: örn., AWS-12345, PMP-67890

source: Writing Tips
tr: Yazım İpuçları

# keepItConcise
source: Keep it concise (3-5 sentences, 100-500 characters)
tr: Kısa tutun (3-5 cümle, 100-500 karakter)

# highlightKeyStrengths
source: • Highlight your key strengths and experience
tr: • Öne çıkan güçlü yönlerinizi ve deneyiminizi vurgulayın

# mentionCareerGoals
source: • Mention your career goals and what you bring
tr: • Kariyer hedeflerinizi ve katabileceklerinizi belirtin

# useActionWords
source: • Use action words and quantifiable achievements
tr: • Eylem odaklı ve ölçülebilir ifadeler kullanın

# tailorToRole
source: • Tailor it to the specific role you're applying for
tr: • Başvurduğunuz role özel olarak uyarlayın

source: Too short
tr: Çok kısa

source: Too long
tr: Çok uzun

source: Perfect length
tr: İdeal uzunluk

source: Character count
tr: Karakter sayısı

source: Pro Tips
tr: Pro İpuçları

# summaryGrabAttention
source: Your summary should grab attention immediately. Start with your years of experience or key achievement, then mention 2-3 core skills, and end with what you're looking for or can contribute.
tr: Özetiniz dikkat çekici olmalı. Deneyim süreniz veya önemli bir başarınızla başlayın, ardından 2-3 temel becerinizden bahsedin ve ne aradığınız ya da nasıl katkı sağlayabileceğinizle bitirin.

# modernSidebarDescription
source: Professional modern CV with colored sidebar for personal info and skills
tr: Kişisel bilgiler ve beceriler için renkli yan menüye sahip modern CV

# minimalCleanDescription
source: Simple and clean CV design focusing on content
tr: İçeriğe odaklanan sade ve temiz CV tasarımı

# professionalCorporateDescription
source: Professional corporate style with classic layout
tr: Kurumsal ve klasik görünümlü profesyonel CV

source: Select Theme
tr: Tema Seç

# descriptionRequired
source: Description is required
tr: Açıklama gereklidir

# descriptionTooShort
source: Description is too short (minimum 50 characters)
tr: Açıklama çok kısa (minimum 50 karakter)
